{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Сдать решение задачи H - Сортировка дат\n",
    "* Полный балл: 150\n",
    "* Штраф за посылку: 1\n",
    "* Ограничение времени: 1 с\n",
    "* Ограничение реального времени: 1 с\n",
    "* Ограничение памяти: 64М\n",
    "\n",
    "Необходимо отсортировать набор дат в хронологическом порядке по возрастанию.\n",
    "Дата состоит из дня, месяца, года и времени с точностью до минут.\n",
    "Названия месяцев английские, с заглавной буквы.\n",
    "Диапазон времени 00:00 - 23:59\n",
    "\n",
    "---\n",
    "# Формат входных данных\n",
    "В первой строке число N - количество записей. В последующих N строках даты в формате \"ЧислоМесяца НазваниеМесяца Год Час:Минута\". Для записи минут используется два знака, т.е. с лидирующим нулём, если количество минут меньше 10.\n",
    "# Формат выходных данных\n",
    "N строк - отсортированные записи."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---\n",
    "# Код"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "7\n",
      "24 May 1953 09:38\n",
      "21 December 1925 20:20\n",
      "5 October 1932 03:27\n",
      "18 June 2004 14:53\n",
      "3 June 1975 14:14\n",
      "2 March 1988 18:07\n",
      "13 December 1996 02:09\n",
      "\n",
      "[24, 4, 1953, 9, 38]\n",
      "[21, 11, 1925, 20, 20]\n",
      "[5, 9, 1932, 3, 27]\n",
      "[18, 5, 2004, 14, 53]\n",
      "[3, 5, 1975, 14, 14]\n",
      "[2, 2, 1988, 18, 7]\n",
      "[13, 11, 1996, 2, 9]\n",
      "\n",
      "21 December 1925 20:20\n",
      "5 October 1932 03:27\n",
      "24 May 1953 09:38\n",
      "3 June 1975 14:14\n",
      "2 March 1988 18:07\n",
      "13 December 1996 02:09\n",
      "18 June 2004 14:53\n"
     ]
    }
   ],
   "source": [
    "import random\n",
    "\n",
    "\n",
    "# ОПРЕДЕЛЯЕМ КОЛИЧЕСТВО ДАТ\n",
    "N = random.randint(3, 7)\n",
    "print(N)\n",
    "\n",
    "months_dict = {'January' : 0, 'February' : 1, 'March' : 2, 'April' : 3, 'May' : 4, 'June' : 5, 'July' : 6, 'August' : 7, 'September' : 8, 'October' : 9, 'November' : 10, 'December' : 11}\n",
    "months = list(months_dict.keys())\n",
    "\n",
    "\n",
    "# ФУНКЦИЯ ДОБАВЛЕНИЯ ЛИДИРУЮЩЕГО НУЛЯ\n",
    "def zero_prefix(num):\n",
    "    if num < 10:\n",
    "        num = '0' + str(num)\n",
    "    else:\n",
    "        num = num\n",
    "    return num\n",
    "\n",
    "\n",
    "# ПУЗЫРЬКОВАЯ СОРТИРОВКА, МОДИФИЦИРОВАННАЯ ДЛЯ СОРТИРОВКИ МАССИВОВ ПО ЗАДАННОМУ ЭЛЕМЕНТУ МАССИВА\n",
    "def bSort(array, pos):\n",
    "    # ОПРЕДЕЛЯЕМ ДЛИНУ МАССИВА\n",
    "    l = len(array)\n",
    "    # ВНЕШНИЙ ЦИКЛ, ЧИСЛО ПРОХОДОВ N-1\n",
    "    for i in range(l):\n",
    "        # ВНУТРЕННИЙ ЦИКЛ, N-i-1 ПРОХОДОВ\n",
    "        for j in range(0, l-i-1):\n",
    "            # МЕНЯЕМ ЭЛЕМЕНТЫ МЕСТАМИ\n",
    "            if array[j][pos] > array[j+1][pos]:\n",
    "                temp = array[j]\n",
    "                array[j] = array[j+1]\n",
    "                array[j+1] = temp\n",
    "    return array\n",
    "\n",
    "\n",
    "# ГЕНЕРАЦИЯ ДАТ\n",
    "dates = []\n",
    "for i in range(N):\n",
    "    day = random.randint(1, 28)\n",
    "    month = random.randint(0, 11)\n",
    "    year = random.randint(1920, 2020)\n",
    "    hour = zero_prefix(random.randint(0, 23))\n",
    "    minute = zero_prefix(random.randint(0, 59))\n",
    "\n",
    "    date = f'{day} {months[month]} {year} {hour}:{minute}'\n",
    "    dates.append(date)\n",
    "    print(date)\n",
    "\n",
    "print()\n",
    "\n",
    "# ПАРСИМ ВХОДНУЮ СТРОКУ И ПРИВОДИМ ДАННЫЕ К ЦИФРОВОМУ ФОРМАТУ\n",
    "parse_list = []\n",
    "i = 0\n",
    "for date in dates:\n",
    "    parse_list.append(date.split(' '))\n",
    "    parse_list[i][0] = int(parse_list[i][0]) # ДНИ\n",
    "    parse_list[i][1] = int(months_dict[parse_list[i][1]]) # МЕСЯЦЫ\n",
    "    parse_list[i][2] = int(parse_list[i][2]) # ГОДЫ\n",
    "    hm = parse_list[i][3].split(':') # [ЧАСЫ, МИНУТЫ]\n",
    "    parse_list[i][3] = int(hm[0])  # ЧАСЫ\n",
    "    parse_list[i].append(int(hm[1])) # МИНУТЫ\n",
    "    print(parse_list[i])\n",
    "    i += 1\n",
    "\n",
    "# ОПРЕДЕЛЯЕМ ПОРЯДОК СОРТИРОВКИ - СЕКУНДЫ, ЧАСЫ, ДНИ, МЕСЯЦЫ, ГОДЫ\n",
    "sort_order = [4, 3, 0, 1, 2]\n",
    "for i in sort_order:\n",
    "    parse_list = bSort(parse_list, i)\n",
    "parse_list\n",
    "\n",
    "print()\n",
    "\n",
    "# ВОЗВРАТ К УКАЗАННОМУ ФОРМАТУ ЗАПИСИ\n",
    "for date in parse_list:\n",
    "    date = f'{date[0]} {months[date[1]]} {date[2]} {zero_prefix(date[3])}:{zero_prefix(date[4])}'\n",
    "    print(date)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
